In [161]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd
import numpy as np

In [31]:
#creating dataframe

df = pd.DataFrame([['sandesh','more',21],['siddhesh','lad',25],['pranay','chopra',18],['abishek','patil',29],
                  ['john','mackenzie',15],['albert','decousta',16],['jimmy','frank',18],['amit','patel',30]],
                  index = [i for i in np.arange(1,9)],
                  columns = ['first_name','last_name','age'])
df.index.name = 'index'
print(df)

      first_name  last_name  age
index
1        sandesh       more   21
2       siddhesh        lad   25
3         pranay     chopra   18
4        abishek      patil   29
5           john  mackenzie   15
6         albert   decousta   16
7          jimmy      frank   18
8           amit      patel   30

In [37]:
print(df.head(2),'\n\n',
      df.tail(2))

      first_name last_name  age
index
1        sandesh      more   21
2       siddhesh       lad   25

       first_name last_name  age
index
7          jimmy     frank   18
8           amit     patel   30

In [167]:
#getting specific column
df[['first_name']]         #or df.first_name 

#getting multiple columns
df[['first_name','last_name']]

      first_name
index
1        sandesh
2       siddhesh
3         pranay
4        abishek
5           john
6         albert
7          jimmy
8           amit

      first_name  last_name
index
1        sandesh       more
2       siddhesh        lad
3         pranay     chopra
4        abishek      patil
5           john  mackenzie
6         albert   decousta
7          jimmy      frank
8           amit      patel

In [172]:
#getting rows
for i in df.values:
    print(type(i),i)

<class 'numpy.ndarray'> ['sandesh' 'more' 21]
<class 'numpy.ndarray'> ['siddhesh' 'lad' 25]
<class 'numpy.ndarray'> ['pranay' 'chopra' 18]
<class 'numpy.ndarray'> ['abishek' 'patil' 29]
<class 'numpy.ndarray'> ['john' 'mackenzie' 15]
<class 'numpy.ndarray'> ['albert' 'decousta' 16]
<class 'numpy.ndarray'> ['jimmy' 'frank' 18]
<class 'numpy.ndarray'> ['amit' 'patel' 30]

In [159]:
#some attributes of dataframe
df.shape
len(df)
df.index
df.columns
df.info()
df.count()

(8, 3)

8

Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64', name='index')

Index(['first_name', 'last_name', 'age'], dtype='object')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 3 columns):
first_name    8 non-null object
last_name     8 non-null object
age           8 non-null int64
dtypes: int64(1), object(2)
memory usage: 448.0+ bytes

first_name    8
last_name     8
age           8
dtype: int64

In [160]:
df['age'].sum()
df['age'].cumsum()
df['age'].max()   #similarly min, idxmax() ,idxmin(), mean(), median(), std(), var()

172

index
1     21
2     46
3     64
4     93
5    108
6    124
7    142
8    172
Name: age, dtype: int64

30

In [146]:
#single row by specifying index
df.iloc[5]       # df[5] not allowed

16

In [157]:
#handling missing colmns
#df.dropna() 
#df.fillna(0)